{
  "common": {
    "name": "synochat",
    "version": "1.4.0",
    "news": {
      "1.3.3": {
        "en": "Updated admin UI to fix desponsive design (mobile view) - #28",
        "de": "Aktualisierte Admin-UI, um desponsives Design zu beheben (mobile Ansicht) - #28",
        "ru": "Обновленный пользовательский интерфейс администратора для исправления деспонсивного дизайна (мобильный вид) - #28",
        "pt": "IU de administração actualizada para corrigir o design não responsivo (vista móvel) - #28",
        "nl": "UI voor beheer bijgewerkt om wanonsief ontwerp te herstellen (mobiele weergave) - #28",
        "fr": "Mise à jour de l'interface d'administration pour corriger le design desponsive (vue mobile) - #28",
        "it": "Aggiornata l'interfaccia utente dell'amministrazione per correggere il design desponsivo (vista mobile) - #28",
        "es": "Actualizada la interfaz de administración para corregir el diseño desponsive (vista móvil) - #28",
        "pl": "Zaktualizowano interfejs administratora, aby naprawić desponsywny wygląd (widok mobilny) - #28",
        "uk": "Оновлений інтерфейс адміністратора для виправлення деспонсивного дизайну (мобільний вигляд) - #28",
        "zh-cn": "Updated admin UI to fix desponsive design (mobile view) - #28"
      },
      "1.3.2": {
        "en": "Fixed issue with 5 digit port number when using a IP for property Synology URL/IP - #20\nAddressed W[171],W[105],W[109] - #18\nUpdated admin style.css and classes to support scrolling on mobile device view - #24\nUpdated several dependencies to met the current overall config - #21\nUpdate test-workflow to be prepared for Node.js v22 - #22\nBumped min. Node.js version to v18 - #22\nBumped @iobroker/adapter-core to version >= 3.x.x - #23\nUpdated ESLint usage and config - Migration to ESLint 9 - #25 ",
        "de": "Problem mit 5-stelliger Portnummer bei Verwendung einer IP für die Eigenschaft Synology URL/IP behoben - #20\nAngesprochen W[171],W[105],W[109] - #18\nAktualisierte admin style.css und Klassen zur Unterstützung des Scrollens bei der Ansicht auf mobilen Geräten - #24\nMehrere Abhängigkeiten aktualisiert, um die aktuelle Gesamtkonfiguration zu erfüllen - #21\nTest-Workflow aktualisieren, um für Node.js v22 vorbereitet zu sein - #22\nErhöhte min. Node.js Version auf v18 - #22\nErhöht @iobroker/adapter-core auf Version >= 3.x.x - #23\nAktualisierte ESLint-Nutzung und -Konfiguration - Migration zu ESLint 9 - #25",
        "ru": "Исправлена проблема с 5-значным номером порта при использовании IP-адреса для URL/IP собственности Synology - #20\nОбращались к W[171], W[105], W[109] - #18\nОбновлен файл style.css и классы админки для поддержки прокрутки на мобильных устройствах - #24\nОбновление нескольких зависимостей для соответствия текущему общему конфигу - #21\nОбновление тестового рабочего процесса для подготовки к Node.js v22 - #22\nПовышение мин. Версия Node.js до v18 - #22\nОбновление @iobroker/adapter-core до версии >= 3.x.x - #23\nОбновление использования и конфигурации ESLint - Переход на ESLint 9 - #25",
        "pt": "Corrigido o problema com o número de porta de 5 dígitos ao utilizar um IP para a propriedade URL/IP da Synology - #20\nEndereçado a W[171],W[105],W[109] - #18\nAtualizado o style.css e as classes do admin para suportar o scrolling na visualização de dispositivos móveis - #24\nAtualização de várias dependências para corresponder à configuração geral atual - #21\nAtualizar o test-workflow para estar preparado para o Node.js v22 - #22\nAumento da versão min. versão do Node.js para v18 - #22\nAdicionado @iobroker/adapter-core à versão >= 3.x.x - #23\nUtilização e configuração actualizadas do ESLint - Migração para o ESLint 9 - #25",
        "nl": "Probleem met 5-cijferig poortnummer opgelost bij gebruik van een IP voor eigenschap Synology URL/IP - #20\nGeadresseerd W[171],W[105],W[109] - #18\nAdmin style.css en classes bijgewerkt om scrollen op mobiele apparaten te ondersteunen - #24\nVerscheidene afhankelijkheden bijgewerkt om te voldoen aan de huidige algemene configuratie - #21\nTest-workflow bijwerken om klaar te zijn voor Node.js v22 - #22\nMin. Node.js-versie naar v18 - #22\n@iobroker/adapter-core gebumpt naar versie >= 3.x.x - #23\nGebruik en configuratie van ESLint bijgewerkt - Migratie naar ESLint 9 - #25",
        "fr": "Correction du problème avec le numéro de port à 5 chiffres lors de l'utilisation d'une IP pour l'URL/IP de la propriété Synology - #20\nAdressé W[171],W[105],W[109] - #18\nMise à jour du fichier admin style.css et des classes pour prendre en charge le défilement sur les appareils mobiles - #24\nMise à jour de plusieurs dépendances pour respecter la configuration globale actuelle - #21\nMise à jour du test-workflow pour être prêt pour Node.js v22 - #22\nBumped min. Node.js à v18 - #22\nPassage de @iobroker/adapter-core à une version >= 3.x.x - #23\nMise à jour de l'utilisation et de la configuration d'ESLint - Migration vers ESLint 9 - #25",
        "it": "Problema risolto con il numero di porta a 5 cifre quando si utilizza un IP per la proprietà Synology URL/IP - #20\nIndirizzo W[171],W[105],W[109] - #18\nAggiornato il file style.css dell'amministratore e le classi per supportare lo scorrimento nella visualizzazione su dispositivi mobili - #24\nAggiornate diverse dipendenze per soddisfare l'attuale configurazione generale - #21\nAggiornare il flusso di test per prepararlo a Node.js v22 - #22\nAggiornata la versione di min. Node.js alla versione v18 - #22\nAggiornato @iobroker/adapter-core alla versione >= 3.x.x - #23\nUtilizzo e configurazione di ESLint aggiornati - Migrazione a ESLint 9 - #25",
        "es": "Solucionado el problema con el número de puerto de 5 dígitos cuando se utiliza una IP para la propiedad Synology URL/IP - #20\nDirigido a W[171],W[105],W[109] - #18\nActualizado admin style.css y clases para apoyar el desplazamiento en la vista del dispositivo móvil - #24\nActualizadas varias dependencias para cumplir con la configuración general actual - #21\nActualizar test-workflow para estar preparado para Node.js v22 - #22\nBumped min. Node.js a v18 - #22\nBumped @iobroker/adapter-core to version >= 3.x.x - #23\nActualización del uso y configuración de ESLint - Migración a ESLint 9 - #25",
        "pl": "Naprawiono błąd z 5-cyfrowym numerem portu podczas korzystania z adresu IP dla adresu URL/IP właściwości Synology - #20\nAdresowane W[171],W[105],W[109] - #18\nZaktualizowano admin style.css i klasy do obsługi przewijania w widoku urządzenia mobilnego - #24\nZaktualizowano kilka zależności, aby spełniały obecną ogólną konfigurację - #21\nAktualizacja test-workflow, aby był przygotowany na Node.js v22 - #22\nPodniesiono min. wersję Node.js do v18 - #22\nPodniesiono @iobroker/adapter-core do wersji >= 3.x.x - #23\nZaktualizowane użycie i konfiguracja ESLint - Migracja do ESLint 9 - #25",
        "uk": "Виправлено проблему з 5-значним номером порту при використанні IP для властивості Synology URL/IP - #20\nАдресат W[171],W[105],W[109] - #18\nОновлений admin style.css та класи для підтримки прокрутки на мобільних пристроях - #24\nОновлено декілька залежностей для відповідності поточній загальній конфігурації - #21\nОновлення тестового робочого процесу для підготовки до Node.js v22 - #22\nBumped min. Версія Node.js до v18 - #22\nВиправлено @iobroker/adapter-core до версії >= 3.x.x - #23\nОновлене використання та конфігурація ESLint - Перехід на ESLint 9 - #25",
        "zh-cn": "Fixed issue with 5 digit port number when using a IP for property Synology URL/IP - #20\nAddressed W[171],W[105],W[109] - #18\nUpdated admin style.css and classes to support scrolling on mobile device view - #24\nUpdated several dependencies to met the current overall config - #21\nUpdate test-workflow to be prepared for Node.js v22 - #22\nBumped min. Node.js version to v18 - #22\nBumped @iobroker/adapter-core to version >= 3.x.x - #23\nUpdated ESLint usage and config - Migration to ESLint 9 - #25 "
      },
      "1.3.1": {
        "en": "Fixed TypeError issue with empty initial value of outgoing channels - #13\nUpdated information about handling of outgoing channels - #14\nFixed special character escaping issue - #16\nAdded text mapping for 'human readable' descriptions of the message parent objects - #14",
        "de": "TypeError-Problem mit leerem Anfangswert für ausgehende Kanäle behoben - #13\nAktualisierte Informationen über die Behandlung von ausgehenden Kanälen - #14\nProblem mit der Escape-Funktion für Sonderzeichen behoben - #16\nText-Zuordnung für \"menschenlesbare\" Beschreibungen der übergeordneten Objekte der Nachricht hinzugefügt - #14",
        "ru": "Исправлена ошибка TypeError при пустом начальном значении исходящих каналов - #13\nОбновленная информация об обработке исходящих каналов - #14\nИсправлена проблема с экранированием специальных символов - #16\nДобавлено текстовое отображение для \"человекочитаемых\" описаний родительских объектов сообщений - #14",
        "pt": "Corrigido o problema de TypeError com o valor inicial vazio dos canais de saída - #13\nInformações actualizadas sobre o tratamento dos canais de saída - #14\nCorrigido o problema de escape de caracteres especiais - #16\nAdicionado o mapeamento de texto para descrições \"legíveis por humanos\" dos objectos-mãe das mensagens - #14",
        "nl": "TypeError probleem met lege initiële waarde van uitgaande kanalen opgelost - #13\nInformatie over de afhandeling van uitgaande kanalen bijgewerkt - #14\nProbleem met escapen van speciale tekens opgelost - #16\nTekstmapping toegevoegd voor 'menselijk leesbare' beschrijvingen van de bericht-ouderobjecten - #14",
        "fr": "Correction d'un problème de TypeError avec une valeur initiale vide pour les canaux sortants - #13\nMise à jour des informations sur le traitement des canaux sortants - #14\nCorrection d'un problème d'échappement des caractères spéciaux - #16\nAjout d'une correspondance textuelle pour les descriptions \"lisibles par l'homme\" des objets parents des messages - #14",
        "it": "Corretto il problema del TypeError con il valore iniziale vuoto dei canali in uscita - #13\nInformazioni aggiornate sulla gestione dei canali in uscita - #14\nCorretto il problema dell'escape dei caratteri speciali - #16\nAggiunta di una mappatura del testo per descrizioni \"leggibili dall'uomo\" degli oggetti padre dei messaggi - #14",
        "es": "Corregido TypeError con el valor inicial vacío de los canales salientes - #13\nInformación actualizada sobre la gestión de los canales salientes - #14\nSolucionado el problema de escape de caracteres especiales - #16\nAñadido mapeo de texto para descripciones \"legibles\" de los objetos padre de los mensajes - #14",
        "pl": "Naprawiono błąd TypeError z pustą wartością początkową kanałów wychodzących - #13\nZaktualizowano informacje o obsłudze kanałów wychodzących - #14\nNaprawiono błąd ucieczki znaków specjalnych - #16\nDodano mapowanie tekstu dla \"czytelnych dla człowieka\" opisów obiektów nadrzędnych wiadomości - #14",
        "uk": "Виправлено помилку TypeError з порожнім початковим значенням вихідних каналів - #13\nОновлена інформація про роботу з вихідними каналами - #14\nВиправлено проблему екранування спеціальних символів - #16\nДодано текстове відображення для \"читабельних\" описів батьківських об'єктів повідомлень - #14",
        "zh-cn": "Fixed TypeError issue with empty initial value of outgoing channels - #13\nUpdated information about handling of outgoing channels - #14\nFixed special character escaping issue - #16\nAdded text mapping for 'human readable' descriptions of the message parent objects - #14"
      },
      "1.3.0": {
        "en": "Added feature to react on messages from Notification-Manager\nAdded feature to react on general received messages sent to the `synochat` adapter instance.\nAdded message templates for received messages from other adapters.\nAdded message templates for object values related to an associated channel.",
        "de": "Funktion hinzugefügt, um auf Nachrichten vom Notification-Manager zu reagieren\nFunktion hinzugefügt, um auf allgemein empfangene Nachrichten zu reagieren, die an die Adapterinstanz `synochat` gesendet werden.\nEs wurden Nachrichtenvorlagen für empfangene Nachrichten von anderen Adaptern hinzugefügt.\nEs wurden Nachrichtenvorlagen für Objektwerte hinzugefügt, die sich auf einen zugeordneten Kanal beziehen.",
        "ru": "Добавлена возможность реагировать на сообщения от менеджера уведомлений\nДобавлена возможность реагировать на общие полученные сообщения, отправленные экземпляру адаптера `synochat`.\nДобавлены шаблоны сообщений для полученных сообщений от других адаптеров.\nДобавлены шаблоны сообщений для значений объектов, связанных с ассоциированным каналом.",
        "pt": "Adicionada funcionalidade para reagir a mensagens do Gestor de Notificações\nAdicionada funcionalidade para reagir a mensagens gerais recebidas enviadas para a instância do adaptador `synochat`.\nAdicionados modelos de mensagens para mensagens recebidas de outros adaptadores.\nAdicionados modelos de mensagens para valores de objectos relacionados com um canal associado.",
        "nl": "Functie toegevoegd om te reageren op berichten van Notification-Manager\nFunctie toegevoegd om te reageren op algemeen ontvangen berichten die naar de `synochat` adapterinstantie worden gestuurd.\nBerichtsjablonen toegevoegd voor ontvangen berichten van andere adapters.\nBerichtsjablonen toegevoegd voor objectwaarden gerelateerd aan een geassocieerd kanaal.",
        "fr": "Ajout d'une fonctionnalité permettant de réagir aux messages du gestionnaire de notifications\nAjout d'une fonctionnalité permettant de réagir aux messages généraux reçus et envoyés à l'instance de l'adaptateur `synochat`.\nAjout de modèles de messages pour les messages reçus d'autres adaptateurs.\nAjout de modèles de messages pour les valeurs d'objets liées à un canal associé.",
        "it": "Aggiunta la possibilità di reagire ai messaggi del gestore delle notifiche.\nAggiunta la funzione di reagire ai messaggi ricevuti in generale inviati all'istanza dell'adattatore `synochat`.\nAggiunti modelli di messaggio per i messaggi ricevuti da altri adattatori.\nAggiunti modelli di messaggio per i valori degli oggetti relativi a un canale associato.",
        "es": "Se ha añadido la posibilidad de reaccionar a los mensajes del gestor de notificaciones.\nSe ha añadido una función para reaccionar a los mensajes generales recibidos enviados a la instancia del adaptador `synochat`.\nAñadidas plantillas de mensajes para los mensajes recibidos de otros adaptadores.\nAñadidas plantillas de mensajes para valores de objetos relacionados con un canal asociado.",
        "pl": "Dodano funkcję reagowania na wiadomości z menedżera powiadomień.\nDodano funkcję reagowania na ogólne otrzymane wiadomości wysyłane do instancji adaptera `synochat`.\nDodano szablony wiadomości dla wiadomości otrzymanych od innych adapterów.\nDodano szablony wiadomości dla wartości obiektów powiązanych z powiązanym kanałem.",
        "uk": "Додано функцію реагування на повідомлення з Notification-Manager\nДодано можливість реагувати на загальні отримані повідомлення, надіслані на екземпляр адаптера `синочату`.\nДодано шаблони повідомлень для отриманих повідомлень від інших адаптерів.\nДодано шаблони повідомлень для значень об'єктів, пов'язаних з асоційованим каналом.",
        "zh-cn": "Added feature to react on messages from Notification-Manager\nAdded feature to react on general received messages sent to the `synochat` adapter instance.\nAdded message templates for received messages from other adapters.\nAdded message templates for object values related to an associated channel."
      },
      "1.2.1": {
        "en": "The IP family check to determine the local IP address of the ioBroker instance has been adjusted.",
        "de": "Die IP-Familienprüfung zur Ermittlung der lokalen IP-Adresse der ioBroker-Instanz wurde angepasst.",
        "ru": "Была скорректирована проверка семейства IP-адресов для определения локального IP-адреса экземпляра ioBroker.",
        "pt": "A verificação da família IP para determinar o endereço IP local da instância do ioBroker foi ajustada.",
        "nl": "De IP-familiecontrole om het lokale IP-adres van de ioBroker-instantie te bepalen is aangepast.",
        "fr": "La vérification de la famille IP pour déterminer l'adresse IP locale de l'instance ioBroker a été ajustée.",
        "it": "Il controllo della famiglia IP per determinare l'indirizzo IP locale dell'istanza ioBroker è stato modificato.",
        "es": "Se ha ajustado la comprobación de la familia IP para determinar la dirección IP local de la instancia de ioBroker.",
        "pl": "Dostosowano sprawdzanie rodziny IP w celu określenia lokalnego adresu IP instancji ioBroker.",
        "uk": "Перевірка сімейства IP для визначення локальної IP-адреси екземпляра ioBroker була скоригована.",
        "zh-cn": "The IP family check to determine the local IP address of the ioBroker instance has been adjusted."
      },
      "1.2.0": {
        "en": "Added enhancement #6 - Delayed sending of messages has been added to work around the limitations of messages sent to the Synology Chat Server in a certain time interval.\nRegarding #6, a message queue has been added to ensure that the order of messages to be sent is respected when the sending of messages is delayed.\nImplementation of the [requirements](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127520995) for adding the adapter in the ioBroker repository - Adding MIT license hint to the Readme.\nmplementation of the [requirements](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127520995) for adding the adapter in the ioBroker repository - Moved adapter instance object subscription after initial connectivity check.\nImplementation of the [requirements](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127520995) for adding the adapter in the ioBroker repository - Added exception handling to cover https://github.com/nodejs/node/issues/43014 in Nodejs 18\nImplementation of the [requirements](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127527703) for adding the adapter in the ioBroker repository - Added axios as dependency in package.json",
        "de": "Verbesserung #6 - Das verzögerte Senden von Nachrichten wurde hinzugefügt, um die Begrenzung der an den Synology Chat Server gesendeten Nachrichten in einem bestimmten Zeitintervall zu umgehen.\nZu Nr. 6: Es wurde eine Nachrichten-Warteschlange hinzugefügt, um sicherzustellen, dass die Reihenfolge der zu versendenden Nachrichten eingehalten wird, wenn sich der Versand von Nachrichten verzögert.\nImplementierung der [requirements](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127520995) für das Hinzufügen des Adapters in das ioBroker-Repository - Hinzufügen des MIT-Lizenz-Hinweises in der Readme.\nUmsetzung der [Anforderungen](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127520995) für das Hinzufügen des Adapters in das ioBroker-Repository - Verschieben der Subskription des Adapterinstanzobjekts nach der ersten Konnektivitätsprüfung.\nImplementierung der [Anforderungen](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127520995) für das Hinzufügen des Adapters in das ioBroker-Repository - Hinzufügen der Ausnahmebehandlung zur Abdeckung von https://github.com/nodejs/node/issues/43014 in Nodejs 18\nImplementierung der [requirements](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127527703) für das Hinzufügen des Adapters im ioBroker-Repository - Axios als Abhängigkeit in package.json hinzugefügt",
        "ru": "Добавлено усовершенствование № 6 - добавлена задержка отправки сообщений для решения проблемы ограничения количества сообщений, отправляемых на сервер Synology Chat Server в определенный промежуток времени.\nЧто касается #6, была добавлена очередь сообщений, чтобы обеспечить соблюдение порядка отправки сообщений при задержке их отправки.\nРеализация [требований](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127520995) для добавления адаптера в репозиторий ioBroker - Добавление подсказки о лицензии MIT в Readme.\nВыполнение [требований](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127520995) для добавления адаптера в репозиторий ioBroker - Перемещена подписка на объект экземпляра адаптера после первоначальной проверки подключения.\nРеализация [требований](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127520995) для добавления адаптера в репозиторий ioBroker - Добавлена обработка исключений для покрытия https://github.com/nodejs/node/issues/43014 в Nodejs 18\nРеализация [требований](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127527703) для добавления адаптера в репозиторий ioBroker - Добавлена зависимость axios в package.json",
        "pt": "Melhoria adicionada #6 - O envio diferido de mensagens foi adicionado para contornar as limitações de mensagens enviadas para o Synology Chat Server num determinado intervalo de tempo.\nRelativamente ao n.º 6, foi acrescentada uma fila de mensagens para garantir que a ordem das mensagens a enviar é respeitada quando o envio de mensagens sofre atrasos.\nImplementação dos [requisitos](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127520995) para adicionar o adaptador no repositório ioBroker - Adição da dica de licença MIT ao Readme.\nmplementação dos [requisitos](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127520995) para adicionar o adaptador no repositório ioBroker - Assinatura do objeto da instância do adaptador movida após a verificação inicial da conetividade.\nImplementação dos [requisitos](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127520995) para adicionar o adaptador no repositório ioBroker - Adicionado tratamento de excepções para abranger https://github.com/nodejs/node/issues/43014 no Nodejs 18\nImplementação dos [requisitos](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127527703) para adicionar o adaptador no repositório ioBroker - Adicionado o axios como dependência no package.json",
        "nl": "Verbetering #6 toegevoegd - Vertraagde verzending van berichten is toegevoegd om te werken rond de beperkingen van berichten die worden verzonden naar de Synology Chat Server in een bepaald tijdsinterval.\nMet betrekking tot #6 is er een berichtenwachtrij toegevoegd om ervoor te zorgen dat de volgorde van de te verzenden berichten wordt gerespecteerd wanneer het verzenden van berichten vertraging oploopt.\nImplementatie van de [vereisten](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127520995) voor het toevoegen van de adapter in de ioBroker repository - MIT-licentiehint toevoegen aan de Readme.\nmplementatie van de [vereisten](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127520995) voor het toevoegen van de adapter in de ioBroker-repository - Verplaatst abonnement op instantie-object van adapter na initiële connectiviteitscontrole.\nImplementatie van de [vereisten](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127520995) voor het toevoegen van de adapter in de ioBroker repository - Uitzonderingsafhandeling toegevoegd voor https://github.com/nodejs/node/issues/43014 in Nodejs 18\nImplementatie van de [vereisten](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127527703) voor het toevoegen van de adapter in de ioBroker repository - Axios toegevoegd als afhankelijkheid in package.json",
        "fr": "Amélioration #6 - L'envoi différé des messages a été ajouté pour contourner les limitations des messages envoyés au Synology Chat Server dans un certain intervalle de temps.\nEn ce qui concerne le point 6, une file d'attente de messages a été ajoutée pour garantir que l'ordre des messages à envoyer est respecté lorsque l'envoi des messages est retardé.\nImplémentation des [requirements](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127520995) pour ajouter l'adaptateur dans le dépôt ioBroker - Ajout de l'indication de la licence MIT dans le Readme.\nMise en œuvre des [exigences] (https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127520995) pour l'ajout de l'adaptateur dans le référentiel ioBroker - Déplacement de l'abonnement à l'objet instance de l'adaptateur après la vérification initiale de la connectivité.\nImplémentation des [requirements](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127520995) pour l'ajout de l'adaptateur dans le référentiel ioBroker - Ajout de la gestion des exceptions pour couvrir https://github.com/nodejs/node/issues/43014 dans Nodejs 18\nImplémentation des [requirements](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127527703) pour ajouter l'adaptateur dans le référentiel ioBroker - Ajout d'axios comme dépendance dans le package.json",
        "it": "Miglioramento aggiunto #6 - È stato aggiunto l'invio ritardato dei messaggi per aggirare le limitazioni dei messaggi inviati al Synology Chat Server in un certo intervallo di tempo.\nPer quanto riguarda il punto #6, è stata aggiunta una coda di messaggi per garantire che l'ordine dei messaggi da inviare sia rispettato quando l'invio dei messaggi è ritardato.\nImplementazione dei [requisiti](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127520995) per l'aggiunta dell'adattatore nel repository ioBroker - Aggiunta del suggerimento di licenza MIT al Readme.\nmplementazione dei [requisiti](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127520995) per l'aggiunta dell'adattatore nel repository ioBroker - Spostamento della sottoscrizione dell'oggetto istanza dell'adattatore dopo la verifica iniziale della connettività.\nImplementazione dei [requisiti](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127520995) per l'aggiunta dell'adattatore nel repository ioBroker - Aggiunta la gestione delle eccezioni per coprire https://github.com/nodejs/node/issues/43014 in Nodejs 18\nImplementazione dei [requisiti](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127527703) per l'aggiunta dell'adattatore nel repository ioBroker - Aggiunta di axios come dipendenza in package.json",
        "es": "Mejora añadida n.º 6: se ha añadido el envío retardado de mensajes para solucionar las limitaciones de mensajes enviados al servidor de Synology Chat en un intervalo de tiempo determinado.\nEn cuanto al nº 6, se ha añadido una cola de mensajes para garantizar que se respeta el orden de envío de los mensajes cuando se retrasa el envío de los mismos.\nImplementación de los [requisitos](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127520995) para añadir el adaptador en el repositorio ioBroker - Adición de la sugerencia de licencia MIT al Léame.\nmplementación de los [requisitos](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127520995) para añadir el adaptador en el repositorio ioBroker - Suscripción de objeto de instancia de adaptador movida después de la comprobación de conectividad inicial.\nImplementación de los [requisitos](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127520995) para añadir el adaptador en el repositorio ioBroker - Añadido manejo de excepciones para cubrir https://github.com/nodejs/node/issues/43014 en Nodejs 18\nImplementación de los [requisitos](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127527703) para añadir el adaptador en el repositorio ioBroker - Añadido axios como dependencia en package.json",
        "pl": "Dodano ulepszenie #6 - Dodano opóźnione wysyłanie wiadomości, aby obejść ograniczenia wiadomości wysyłanych do serwera Synology Chat Server w określonym przedziale czasu.\nJeśli chodzi o #6, dodano kolejkę wiadomości, aby zapewnić, że kolejność wysyłanych wiadomości jest przestrzegana, gdy wysyłanie wiadomości jest opóźnione.\nImplementacja [wymagań](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127520995) do dodawania adaptera w repozytorium ioBroker - Dodanie podpowiedzi licencji MIT do Readme.\nmplementacja [wymagań](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127520995) dla dodania adaptera w repozytorium ioBroker - Przeniesiono subskrypcję obiektu instancji adaptera po wstępnym sprawdzeniu łączności.\nImplementacja [wymagań](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127520995) do dodawania adaptera w repozytorium ioBroker - Dodano obsługę wyjątków w celu uwzględnienia https://github.com/nodejs/node/issues/43014 w Nodejs 18\nImplementacja [wymagań](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127527703) do dodawania adaptera w repozytorium ioBroker - Dodano axios jako zależność w package.json.",
        "uk": "Додано вдосконалення #6 - Додано функцію відкладеного надсилання повідомлень, щоб обійти обмеження на кількість повідомлень, що надсилаються на сервер чату Synology через певний проміжок часу.\nЩодо #6, було додано чергу повідомлень, щоб забезпечити дотримання порядку надсилання повідомлень у разі затримки надсилання повідомлень.\nРеалізація [вимог](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127520995) для додавання адаптера до репозиторію ioBroker - Додавання підказки про ліцензію MIT до Readme.\nреалізація [вимог](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127520995) для додавання адаптера в репозиторій ioBroker - Переміщено підписку на об'єкт екземпляра адаптера після початкової перевірки підключення.\nРеалізація [вимог](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127520995) для додавання адаптера в репозиторій ioBroker - Додано обробку винятків для покриття https://github.com/nodejs/node/issues/43014 в Nodejs 18\nРеалізація [вимог](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127527703) для додавання адаптера в репозиторій ioBroker - Додано axios як залежність в package.json",
        "zh-cn": "Added enhancement #6 - Delayed sending of messages has been added to work around the limitations of messages sent to the Synology Chat Server in a certain time interval.\nRegarding #6, a message queue has been added to ensure that the order of messages to be sent is respected when the sending of messages is delayed.\nImplementation of the [requirements](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127520995) for adding the adapter in the ioBroker repository - Adding MIT license hint to the Readme.\nmplementation of the [requirements](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127520995) for adding the adapter in the ioBroker repository - Moved adapter instance object subscription after initial connectivity check.\nImplementation of the [requirements](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127520995) for adding the adapter in the ioBroker repository - Added exception handling to cover https://github.com/nodejs/node/issues/43014 in Nodejs 18\nImplementation of the [requirements](https://github.com/ioBroker/ioBroker.repositories/pull/1759#issuecomment-1127527703) for adding the adapter in the ioBroker repository - Added axios as dependency in package.json"
      },
      "1.1.1": {
        "en": "Fixed issue #4 - Issue while migrating data from version < 1.1.0\nAdded collecting and loading of default values when loading the initial configuration of the adapter instance\nThe channel search behavior has been adjusted to react accordingly to deactivated channels and to query the remaining channels.",
        "de": "Problem Nr. 4 behoben - Problem bei der Migration von Daten aus Version < 1.1.0\nSammeln und Laden von Standardwerten beim Laden der anfänglichen Konfiguration der Adapterinstanz hinzugefügt\nDas Verhalten der Kanalsuche wurde angepasst, um auf deaktivierte Kanäle entsprechend zu reagieren und die verbleibenden Kanäle abzufragen.",
        "ru": "Исправлена проблема #4 - Проблема при переносе данных из версии < 1.1.0\nДобавлен сбор и загрузка значений по умолчанию при загрузке начальной конфигурации экземпляра адаптера\nПоведение поиска каналов было скорректировано таким образом, чтобы реагировать на деактивированные каналы и запрашивать оставшиеся.",
        "pt": "Problema corrigido #4 - Problema ao migrar dados da versão < 1.1.0\nAdicionada a recolha e carregamento de valores por defeito ao carregar a configuração inicial da instância do adaptador\nO comportamento de pesquisa de canais foi ajustado para reagir em conformidade aos canais desactivados e para consultar os restantes canais.",
        "nl": "Probleem 4 opgelost - Probleem bij het migreren van gegevens van versie < 1.1.0\nVerzamelen en laden van standaardwaarden toegevoegd bij het laden van de initiële configuratie van de instantie adapter\nHet zoekgedrag van de kanalen is aangepast om dienovereenkomstig te reageren op gedeactiveerde kanalen en de resterende kanalen te bevragen.",
        "fr": "Problème corrigé #4 - Problème lors de la migration des données de la version < 1.1.0\nAjout de la collecte et du chargement des valeurs par défaut lors du chargement de la configuration initiale de l'instance de l'adaptateur\nLe comportement de recherche des canaux a été ajusté pour réagir en conséquence aux canaux désactivés et pour interroger les canaux restants.",
        "it": "Problema risolto #4 - Problema durante la migrazione dei dati dalla versione < 1.1.0\nAggiunta la raccolta e il caricamento dei valori predefiniti durante il caricamento della configurazione iniziale dell'istanza dell'adattatore\nIl comportamento di ricerca dei canali è stato adattato per reagire di conseguenza ai canali disattivati e per interrogare i canali rimanenti.",
        "es": "Corregido problema #4 - Problema al migrar datos de versión < 1.1.0\nAñadida la recogida y carga de valores por defecto al cargar la configuración inicial de la instancia del adaptador.\nSe ha ajustado el comportamiento de búsqueda de canales para reaccionar en consecuencia ante los canales desactivados y consultar los canales restantes.",
        "pl": "Naprawiono błąd #4 - Błąd podczas migracji danych z wersji < 1.1.0\nDodano zbieranie i ładowanie wartości domyślnych podczas ładowania początkowej konfiguracji instancji adaptera.\nZachowanie wyszukiwania kanałów zostało dostosowane, aby odpowiednio reagować na dezaktywowane kanały i wyszukiwać pozostałe kanały.",
        "uk": "Виправлено проблему #4 - Проблема при перенесенні даних з версії < 1.1.0\nДодано збір та завантаження значень за замовчуванням під час завантаження початкової конфігурації екземпляра адаптера\nПоведінка пошуку каналів була налаштована таким чином, щоб відповідно реагувати на вимкнені канали та запитувати канали, що залишилися.",
        "zh-cn": "Fixed issue #4 - Issue while migrating data from version < 1.1.0\nAdded collecting and loading of default values when loading the initial configuration of the adapter instance\nThe channel search behavior has been adjusted to react accordingly to deactivated channels and to query the remaining channels."
      }
    },
    "titleLang": {
      "en": "Synology-Chat",
      "de": "Synology-Chat",
      "ru": "Синология-Чат",
      "pt": "Synology-Chat",
      "nl": "Synology-chat",
      "fr": "Synology-Chat",
      "it": "Synology-Chat",
      "es": "Chat de Synology",
      "pl": "Synology-Chat",
      "uk": "Синологія-Чат",
      "zh-cn": "语义-聊天"
    },
    "desc": {
      "en": "This adapter provides an interface between the Synology Chat and ioBroker.",
      "de": "Dieser Adapter bietet eine Schnittstelle zwischen dem Synology Chat und ioBroker.",
      "ru": "Этот адаптер обеспечивает интерфейс между Synology Chat и ioBroker.",
      "pt": "Este adaptador fornece uma interface entre o Synology Chat e ioBroker.",
      "nl": "Deze adapter biedt een interface tussen de Synology Chat en ioBroker.",
      "fr": "Cet adaptateur fournit une interface entre Synology Chat et ioBroker.",
      "it": "Questo adattatore fornisce un'interfaccia tra Synology Chat e ioBroker.",
      "es": "Este adaptador proporciona una interfaz entre el Chat de Sinología y el ioBroker.",
      "pl": "Adapter ten zapewnia interfejs między czatem synologicznym a joBrokerem.",
      "uk": "Цей адаптер надає інтерфейс між Синологічним чатом та ioBroker.",
      "zh-cn": "这个适配器提供了Synology Chat和ioBroker之间的接口."
    },
    "authors": [
      "phoeluga <phoeluga@gmail.com>"
    ],
    "keywords": [
      "Synology",
      "Chat",
      "message",
      "incoming",
      "outgoing",
      "channel"
    ],
    "tier": 3,
    "licenseInformation": {
      "license": "MIT",
      "type": "free"
    },
    "platform": "Javascript/Node.js",
    "icon": "synochat.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/phoeluga/ioBroker.synochat/master/admin/synochat.png",
    "readme": "https://github.com/phoeluga/ioBroker.synochat/blob/master/README.md",
    "loglevel": "info",
    "webExtension": "lib/web.js",
    "mode": "daemon",
    "type": "messaging",
    "compact": true,
    "connectionType": "local",
    "dataSource": "push",
    "adminUI": {
      "config": "materialize"
    },
    "eraseOnUpload": true,
    "messagebox": true,
    "dependencies": [
      {
        "web": ">=3.0.12",
        "js-controller": ">=5.0.19"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=6.0.0"
      }
    ],
    "supportedMessages": {
      "custom": true,
      "notifications": true
    }
  },
  "native": {
    "synoUrl": "",
    "certCheck": true,
    "iobrokerHost": "",
    "webInstance": "",
    "channelName": "",
    "channelToken": "",
    "channelType": "",
    "channelContentCertCheck": true,
    "channels": [
      {
        "channelEnabled": true,
        "channelName": "",
        "channelAccessToken": "",
        "channelType": "incoming",
        "channelObjectValueTemplate": "",
        "channelReactOnNotificationmanager": false,
        "channelReactOnAllIobrokerMessages": false,
        "channelValidateCert": true
      }
    ],
    "receivedNotificationManagerTemplate": "Message from Notification-Manager:\n- ${message.category.name} -\n${message.category.description}\nAffected instances: ${instances}",
    "receivedMessageTemplate": "Message from ioBroker-${from} via ${command}:\n${message}",
    "messageTemplate0": "",
    "messageTemplate1": "",
    "messageTemplate2": "",
    "messageTemplate3": "",
    "messageTemplate4": "",
    "messageTemplate5": "",
    "messageTemplate6": "",
    "messageTemplate7": "",
    "messageTemplate8": "",
    "messageTemplate9": ""
  },
  "objects": [],
  "instanceObjects": [
    {
      "_id": "info",
      "type": "channel",
      "common": {
        "name": "Information"
      },
      "native": {}
    },
    {
      "_id": "info.connection",
      "type": "state",
      "common": {
        "role": "indicator.connected",
        "name": "Synology chat instance ready for use",
        "type": "boolean",
        "read": true,
        "write": false,
        "def": false
      },
      "native": {}
    }
  ]
}